app/controllers/homepages_controller.rb

SELECT "homes".* FROM "homes"
SELECT "plans".* FROM "plans"
SELECT "abouts".* FROM "abouts"
SELECT "slideshows".* FROM "slideshows"
---
  def index
    @homes = Home.all
    @plans = Plan.all
    @abouts = About.all
    @slideshows = Slideshow.all